In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={'Name':['Ramesh','Suresh',np.nan,'Mahesh'],
      'Age':[31,32,33,np.nan],
      'Ciry':[np.nan,'Hyd','Mumbai','Chennai']}

In [4]:
data1=pd.DataFrame(dict1)

In [5]:
data1.isnull() # if data has True value its a null

    Name    Age   Ciry
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [6]:
data1.isnull().sum() # Every column has one missing value

Name    1
Age     1
Ciry    1
dtype: int64

In [7]:
data1.isnull().sum()/len(data1)

Name    0.25
Age     0.25
Ciry    0.25
dtype: float64

In [8]:
data1.isnull().sum()*100/len(data1)

Name    25.0
Age     25.0
Ciry    25.0
dtype: float64

In [9]:
dict2={'Name':['Ramesh','Suresh',None,'Mahesh'],
      'Age':[31,32,33,None],
      'Ciry':[None,'Hyd','Mumbai','Chennai']}

In [11]:
data2=pd.DataFrame(dict2)

In [12]:
data2

     Name   Age     Ciry
0  Ramesh  31.0     None
1  Suresh  32.0      Hyd
2    None  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [13]:
data2.isnull()

    Name    Age   Ciry
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [14]:
data2.isnull().sum()

Name    1
Age     1
Ciry    1
dtype: int64

In [15]:
dict3={'Name':['Ramesh','Suresh','Null','Mahesh'],
      'Age':[31,32,33,'Null'],
      'Ciry':['Null','Hyd','Mumbai','Chennai']}

In [17]:
data3=pd.DataFrame(dict3)

In [18]:
data3

     Name   Age     Ciry
0  Ramesh    31     Null
1  Suresh    32      Hyd
2    Null    33   Mumbai
3  Mahesh  Null  Chennai

In [19]:
data3.isnull()

    Name    Age   Ciry
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [20]:
data3.isnull().sum()

Name    0
Age     0
Ciry    0
dtype: int64

**method-1**

>Fill the missing values with random number

dataframe name= data1

method name:fillna

In [21]:
data1

     Name   Age     Ciry
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [22]:
data1.fillna(40)

     Name   Age     Ciry
0  Ramesh  31.0       40
1  Suresh  32.0      Hyd
2      40  33.0   Mumbai
3  Mahesh  40.0  Chennai

**Method-2**

>Fill the missing values with random number on specific column

dataframe name= data1

method name:fillna

In [23]:
data1['Name'].fillna('Satish')

0    Ramesh
1    Suresh
2    Satish
3    Mahesh
Name: Name, dtype: object

In [25]:
data1['Name'].fillna('Satish',inplace=True)
data1

     Name   Age     Ciry
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2  Satish  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [26]:
# create the data again
dict1={'Name':['Ramesh','Suresh',np.nan,'Mahesh'],
      'Age':[31,32,33,np.nan],
      'Ciry':[np.nan,'Hyd','Mumbai','Chennai']}
data1=pd.DataFrame(dict1)

**Method-3**

- bfill

- ffill

- pad

- backfill

In [27]:
data1

     Name   Age     Ciry
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [29]:
# in the above Names , index 2 is missed value
#     it will be replace by index 3 value
# Age index 3 is missed value
#   we donot have index 4, so the value is NaN
#City index 0 has missed value
#    it replace with index 1 value
data1.fillna(method='backfill')

     Name   Age     Ciry
0  Ramesh  31.0      Hyd
1  Suresh  32.0      Hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [32]:
# create the data again
dict1={'Name':['Ramesh','Suresh',np.nan,'Mahesh'],
      'Age':[31,32,33,np.nan],
      'Ciry':[np.nan,'Hyd','Mumbai','Chennai']}
data1=pd.DataFrame(dict1)

In [33]:
data1

     Name   Age     Ciry
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [34]:
data1.bfill()

     Name   Age     Ciry
0  Ramesh  31.0      Hyd
1  Suresh  32.0      Hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [35]:
# create the data again
dict1={'Name':['Ramesh','Suresh',np.nan,'Mahesh'],
      'Age':[31,32,33,np.nan],
      'Ciry':[np.nan,'Hyd','Mumbai','Chennai']}
data1=pd.DataFrame(dict1)

In [36]:
data1

     Name   Age     Ciry
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [38]:
data1.fillna(method='Pad')

     Name   Age     Ciry
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2  Suresh  33.0   Mumbai
3  Mahesh  33.0  Chennai

In [39]:
# create the data again
dict1={'Name':['Ramesh','Suresh',np.nan,'Mahesh'],
      'Age':[31,32,33,np.nan],
      'Ciry':[np.nan,'Hyd','Mumbai','Chennai']}
data1=pd.DataFrame(dict1)

In [40]:
data1

     Name   Age     Ciry
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [41]:
data1.fillna(method='backfill')

     Name   Age     Ciry
0  Ramesh  31.0      Hyd
1  Suresh  32.0      Hyd
2  Mahesh  33.0   Mumbai
3  Mahesh   NaN  Chennai

- bfill and backfill both are same

- pad and ffill both are same

**Method-4**

- Mean

- Median

- Mode

In [42]:
data1

     Name   Age     Ciry
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

In [44]:
age_means=data1['Age'].mean()
age_means

32.0

In [49]:
data1['Age'].fillna(age_means)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [ ]:
# instead of providing a random number
# we are filling with mean of the data

In [50]:
age_median=data1['Age'].median()
age_median

32.0

In [51]:
data1['Age'].fillna(age_median)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [52]:
# instead of providing a random number
# we are filling with median of the data
age_median=data1['Age'].median()
age_median
data1['Age'].fillna(age_median)

0    31.0
1    32.0
2    33.0
3    32.0
Name: Age, dtype: float64

In [53]:
age_mode=data1['Age'].mode()
age_mode

0    31.0
1    32.0
2    33.0
Name: Age, dtype: float64

In [54]:
data1['Age'].fillna(age_mode)

0    31.0
1    32.0
2    33.0
3     NaN
Name: Age, dtype: float64

In [ ]:
# Company interview
#  level1: Mean median mode
#  Level2: bfill fill
#  level3:

**Method-5**

**KNN imputer**

- KNN: K nearest neighbours
    
    - in the KNN imputer instead of taking mean of all the values
    - it will choose neighbours data 
    - Will take those mean only
    
- this only for numerical data 

<img src="https://cdn1.byjus.com/wp-content/uploads/2021/12/euclidean-distance-formula-derivation.png" class="img-responsive" title="Euclidean Distance Formula Derivation" alt="Euclidean Distance Formula Derivation">

In [ ]:
n-neighbors is parameter can choose by user

if we dont choose by default it will takes as = 5

In [59]:
from sklearn.impute import KNNImputer
knn=KNNImputer(n_neighbors=2)
knn.fit_transform(data1[['Age']])

array([[31.],
       [32.],
       [33.],
       [32.]])

In [60]:
data1

     Name   Age     Ciry
0  Ramesh  31.0      NaN
1  Suresh  32.0      Hyd
2     NaN  33.0   Mumbai
3  Mahesh   NaN  Chennai

**Method-6**

- Based on other columns

- Some times all above methods will not provide good justification

- at that time we need to check other column dependecy also 

- Most of the time will pick a column which have highest co-relation